; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	instrument4 - instrument
	instrument5 - instrument
	satellite2 - satellite
	instrument6 - instrument
	instrument7 - instrument
	satellite3 - satellite
	instrument8 - instrument
	instrument9 - instrument
	instrument10 - instrument
	thermograph0 - mode
	image3 - mode
	infrared4 - mode
	infrared1 - mode
	infrared2 - mode
	Star0 - direction
	Star10 - direction
	Star12 - direction
	Star14 - direction
	Star19 - direction
	Star25 - direction
	Star29 - direction
	GroundStation17 - direction
	Star3 - direction
	GroundStation2 - direction
	Star21 - direction
	GroundStation4 - direction
	GroundStation7 - direction
	Star5 - direction
	Star22 - direction
	Star36 - direction
	GroundStation32 - direction
	Star28 - direction
	Star30 - direction
	Star23 - direction
	GroundStation35 - direction
	Star16 - direction
	GroundStation34 - direction
	GroundStation26 - direction
	Star24 - direction
	Star15 - direction
	GroundStation20 - direction
	GroundStation8 - direction
	GroundStation27 - direction
	Star33 - direction
	GroundStation39 - direction
	Star1 - direction
	Star37 - direction
	Star6 - direction
	Star9 - direction
	Star38 - direction
	GroundStation31 - direction
	GroundStation11 - direction
	GroundStation18 - direction
	GroundStation13 - direction
	Star40 - direction
	Phenomenon41 - direction
	Planet42 - direction
	Planet43 - direction
	Star44 - direction
	Planet45 - direction
	Star46 - direction
	Star47 - direction
	Star48 - direction
	Planet49 - direction
	Star50 - direction
	Phenomenon51 - direction
	Planet52 - direction
	Star53 - direction
	Phenomenon54 - direction
	Phenomenon55 - direction
	Phenomenon56 - direction
	Phenomenon57 - direction
	Planet58 - direction
	Star59 - direction
	Planet60 - direction
	Planet61 - direction
	Star62 - direction
	Phenomenon63 - direction
	Star64 - direction
)
(:init
	(supports instrument0 thermograph0)
	(supports instrument0 image3)
	(supports instrument0 infrared2)
	(calibration_target instrument0 Star38)
	(calibration_target instrument0 GroundStation20)
	(supports instrument1 image3)
	(supports instrument1 infrared4)
	(supports instrument1 infrared2)
	(calibration_target instrument1 Star21)
	(calibration_target instrument1 GroundStation34)
	(calibration_target instrument1 GroundStation27)
	(calibration_target instrument1 GroundStation39)
	(calibration_target instrument1 Star1)
	(calibration_target instrument1 GroundStation11)
	(calibration_target instrument1 GroundStation35)
	(calibration_target instrument1 Star36)
	(calibration_target instrument1 GroundStation17)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon63)
	(supports instrument2 infrared4)
	(supports instrument2 thermograph0)
	(calibration_target instrument2 GroundStation7)
	(calibration_target instrument2 GroundStation4)
	(calibration_target instrument2 Star16)
	(calibration_target instrument2 Star21)
	(calibration_target instrument2 Star38)
	(calibration_target instrument2 GroundStation13)
	(calibration_target instrument2 GroundStation2)
	(calibration_target instrument2 Star3)
	(calibration_target instrument2 Star9)
	(calibration_target instrument2 GroundStation27)
	(calibration_target instrument2 Star28)
	(supports instrument3 infrared2)
	(supports instrument3 image3)
	(supports instrument3 infrared4)
	(calibration_target instrument3 Star28)
	(calibration_target instrument3 GroundStation31)
	(calibration_target instrument3 Star1)
	(supports instrument4 image3)
	(supports instrument4 infrared4)
	(supports instrument4 infrared1)
	(calibration_target instrument4 Star36)
	(calibration_target instrument4 Star24)
	(calibration_target instrument4 GroundStation11)
	(calibration_target instrument4 GroundStation8)
	(calibration_target instrument4 Star22)
	(calibration_target instrument4 GroundStation32)
	(calibration_target instrument4 Star5)
	(calibration_target instrument4 Star23)
	(calibration_target instrument4 Star16)
	(supports instrument5 thermograph0)
	(calibration_target instrument5 Star28)
	(calibration_target instrument5 GroundStation32)
	(calibration_target instrument5 Star23)
	(calibration_target instrument5 Star37)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(on_board instrument5 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Phenomenon51)
	(supports instrument6 thermograph0)
	(supports instrument6 image3)
	(calibration_target instrument6 Star15)
	(calibration_target instrument6 GroundStation8)
	(calibration_target instrument6 Star16)
	(calibration_target instrument6 GroundStation11)
	(calibration_target instrument6 GroundStation35)
	(calibration_target instrument6 Star23)
	(calibration_target instrument6 Star30)
	(supports instrument7 image3)
	(supports instrument7 infrared2)
	(calibration_target instrument7 Star24)
	(calibration_target instrument7 GroundStation18)
	(calibration_target instrument7 GroundStation26)
	(calibration_target instrument7 GroundStation34)
	(on_board instrument6 satellite2)
	(on_board instrument7 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Phenomenon56)
	(supports instrument8 infrared4)
	(supports instrument8 image3)
	(calibration_target instrument8 Star37)
	(calibration_target instrument8 GroundStation39)
	(calibration_target instrument8 GroundStation8)
	(calibration_target instrument8 GroundStation20)
	(calibration_target instrument8 Star15)
	(calibration_target instrument8 Star1)
	(supports instrument9 infrared2)
	(calibration_target instrument9 Star38)
	(calibration_target instrument9 Star9)
	(calibration_target instrument9 Star6)
	(calibration_target instrument9 Star37)
	(calibration_target instrument9 Star1)
	(calibration_target instrument9 GroundStation39)
	(calibration_target instrument9 Star33)
	(calibration_target instrument9 GroundStation27)
	(supports instrument10 image3)
	(supports instrument10 infrared4)
	(supports instrument10 infrared1)
	(calibration_target instrument10 GroundStation13)
	(calibration_target instrument10 GroundStation18)
	(calibration_target instrument10 GroundStation11)
	(calibration_target instrument10 GroundStation31)
	(on_board instrument8 satellite3)
	(on_board instrument9 satellite3)
	(on_board instrument10 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star46)
)
(:goal (and
	(pointing satellite2 Planet45)
	(have_image Star40 image3)
	(have_image Phenomenon41 thermograph0)
	(have_image Planet42 infrared4)
	(have_image Planet43 thermograph0)
	(have_image Star44 infrared2)
	(have_image Planet45 infrared2)
	(have_image Star46 thermograph0)
	(have_image Star47 infrared4)
	(have_image Star48 infrared1)
	(have_image Planet49 thermograph0)
	(have_image Star50 infrared2)
	(have_image Phenomenon51 thermograph0)
	(have_image Planet52 infrared4)
	(have_image Star53 image3)
	(have_image Phenomenon54 thermograph0)
	(have_image Phenomenon55 infrared4)
	(have_image Phenomenon56 infrared4)
	(have_image Phenomenon57 infrared4)
	(have_image Planet58 infrared2)
	(have_image Star59 image3)
	(have_image Planet60 infrared2)
	(have_image Planet61 infrared2)
	(have_image Star62 infrared4)
	(have_image Phenomenon63 infrared4)
	(have_image Star64 thermograph0)
))

)

; plan
1. (switch_on instrument4 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument4)
   goals met: 0 of 26
2. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 26
3. (turn_to satellite2 planet45 phenomenon56)
   deleted: (pointing satellite2 phenomenon56)
   added: (pointing satellite2 planet45)
   goals met: 1 of 26
4. (turn_to satellite1 phenomenon55 phenomenon51)
   deleted: (pointing satellite1 phenomenon51)
   added: (pointing satellite1 phenomenon55)
   goals met: 1 of 26
5. (turn_to satellite0 phenomenon41 phenomenon63)
   deleted: (pointing satellite0 phenomenon63)
   added: (pointing satellite0 phenomenon41)
   goals met: 1 of 26
6. (turn_to satellite1 star5 phenomenon55)
   deleted: (pointing satellite1 phenomenon55)
   added: (pointing satellite1 star5)
   goals met: 1 of 26
7. (calibrate satellite1 instrument4 star5)
   added: (calibrated instrument4)
   goals met: 1 of 26
8. (turn_to satellite1 phenomenon55 star5)
   deleted: (pointing satellite1 star5)
   added: (pointing satellite1 phenomenon55)
   goals met: 1 of 26
9. (take_image satellite1 phenomenon55 instrument4 infrared4)
   added: (have_image phenomenon55 infrared4)
   goals met: 2 of 26
10. (turn_to satellite1 phenomenon56 phenomenon55)
   deleted: (pointing satellite1 phenomenon55)
   added: (pointing satellite1 phenomenon56)
   goals met: 2 of 26
11. (take_image satellite1 phenomenon56 instrument4 infrared4)
   added: (have_image phenomenon56 infrared4)
   goals met: 3 of 26
12. (turn_to satellite1 phenomenon57 phenomenon56)
   deleted: (pointing satellite1 phenomenon56)
   added: (pointing satellite1 phenomenon57)
   goals met: 3 of 26
13. (take_image satellite1 phenomenon57 instrument4 infrared4)
   added: (have_image phenomenon57 infrared4)
   goals met: 4 of 26
14. (turn_to satellite1 phenomenon63 phenomenon57)
   deleted: (pointing satellite1 phenomenon57)
   added: (pointing satellite1 phenomenon63)
   goals met: 4 of 26
15. (take_image satellite1 phenomenon63 instrument4 infrared4)
   added: (have_image phenomenon63 infrared4)
   goals met: 5 of 26
16. (turn_to satellite1 planet42 phenomenon63)
   deleted: (pointing satellite1 phenomenon63)
   added: (pointing satellite1 planet42)
   goals met: 5 of 26
17. (take_image satellite1 planet42 instrument4 infrared4)
   added: (have_image planet42 infrared4)
   goals met: 6 of 26
18. (turn_to satellite1 planet52 planet42)
   deleted: (pointing satellite1 planet42)
   added: (pointing satellite1 planet52)
   goals met: 6 of 26
19. (take_image satellite1 planet52 instrument4 infrared4)
   added: (have_image planet52 infrared4)
   goals met: 7 of 26
20. (turn_to satellite1 star40 planet52)
   deleted: (pointing satellite1 planet52)
   added: (pointing satellite1 star40)
   goals met: 7 of 26
21. (take_image satellite1 star40 instrument4 image3)
   added: (have_image star40 image3)
   goals met: 8 of 26
22. (turn_to satellite1 star47 star40)
   deleted: (pointing satellite1 star40)
   added: (pointing satellite1 star47)
   goals met: 8 of 26
23. (take_image satellite1 star47 instrument4 infrared4)
   added: (have_image star47 infrared4)
   goals met: 9 of 26
24. (turn_to satellite1 star48 star47)
   deleted: (pointing satellite1 star47)
   added: (pointing satellite1 star48)
   goals met: 9 of 26
25. (take_image satellite1 star48 instrument4 infrared1)
   added: (have_image star48 infrared1)
   goals met: 10 of 26
26. (turn_to satellite1 star53 star48)
   deleted: (pointing satellite1 star48)
   added: (pointing satellite1 star53)
   goals met: 10 of 26
27. (take_image satellite1 star53 instrument4 image3)
   added: (have_image star53 image3)
   goals met: 11 of 26
28. (turn_to satellite1 star59 star53)
   deleted: (pointing satellite1 star53)
   added: (pointing satellite1 star59)
   goals met: 11 of 26
29. (take_image satellite1 star59 instrument4 image3)
   added: (have_image star59 image3)
   goals met: 12 of 26
30. (turn_to satellite1 star62 star59)
   deleted: (pointing satellite1 star59)
   added: (pointing satellite1 star62)
   goals met: 12 of 26
31. (take_image satellite1 star62 instrument4 infrared4)
   added: (have_image star62 infrared4)
   goals met: 13 of 26
32. (turn_to satellite0 star38 phenomenon41)
   deleted: (pointing satellite0 phenomenon41)
   added: (pointing satellite0 star38)
   goals met: 13 of 26
33. (calibrate satellite0 instrument0 star38)
   added: (calibrated instrument0)
   goals met: 13 of 26
34. (turn_to satellite0 phenomenon41 star38)
   deleted: (pointing satellite0 star38)
   added: (pointing satellite0 phenomenon41)
   goals met: 13 of 26
35. (take_image satellite0 phenomenon41 instrument0 thermograph0)
   added: (have_image phenomenon41 thermograph0)
   goals met: 14 of 26
36. (turn_to satellite0 phenomenon51 phenomenon41)
   deleted: (pointing satellite0 phenomenon41)
   added: (pointing satellite0 phenomenon51)
   goals met: 14 of 26
37. (take_image satellite0 phenomenon51 instrument0 thermograph0)
   added: (have_image phenomenon51 thermograph0)
   goals met: 15 of 26
38. (turn_to satellite0 phenomenon54 phenomenon51)
   deleted: (pointing satellite0 phenomenon51)
   added: (pointing satellite0 phenomenon54)
   goals met: 15 of 26
39. (take_image satellite0 phenomenon54 instrument0 thermograph0)
   added: (have_image phenomenon54 thermograph0)
   goals met: 16 of 26
40. (turn_to satellite0 planet43 phenomenon54)
   deleted: (pointing satellite0 phenomenon54)
   added: (pointing satellite0 planet43)
   goals met: 16 of 26
41. (take_image satellite0 planet43 instrument0 thermograph0)
   added: (have_image planet43 thermograph0)
   goals met: 17 of 26
42. (turn_to satellite0 planet45 planet43)
   deleted: (pointing satellite0 planet43)
   added: (pointing satellite0 planet45)
   goals met: 17 of 26
43. (take_image satellite0 planet45 instrument0 infrared2)
   added: (have_image planet45 infrared2)
   goals met: 18 of 26
44. (turn_to satellite0 planet49 planet45)
   deleted: (pointing satellite0 planet45)
   added: (pointing satellite0 planet49)
   goals met: 18 of 26
45. (take_image satellite0 planet49 instrument0 thermograph0)
   added: (have_image planet49 thermograph0)
   goals met: 19 of 26
46. (turn_to satellite0 planet58 planet49)
   deleted: (pointing satellite0 planet49)
   added: (pointing satellite0 planet58)
   goals met: 19 of 26
47. (take_image satellite0 planet58 instrument0 infrared2)
   added: (have_image planet58 infrared2)
   goals met: 20 of 26
48. (turn_to satellite0 planet60 planet58)
   deleted: (pointing satellite0 planet58)
   added: (pointing satellite0 planet60)
   goals met: 20 of 26
49. (take_image satellite0 planet60 instrument0 infrared2)
   added: (have_image planet60 infrared2)
   goals met: 21 of 26
50. (turn_to satellite0 planet61 planet60)
   deleted: (pointing satellite0 planet60)
   added: (pointing satellite0 planet61)
   goals met: 21 of 26
51. (take_image satellite0 planet61 instrument0 infrared2)
   added: (have_image planet61 infrared2)
   goals met: 22 of 26
52. (turn_to satellite0 star44 planet61)
   deleted: (pointing satellite0 planet61)
   added: (pointing satellite0 star44)
   goals met: 22 of 26
53. (take_image satellite0 star44 instrument0 infrared2)
   added: (have_image star44 infrared2)
   goals met: 23 of 26
54. (turn_to satellite0 star46 star44)
   deleted: (pointing satellite0 star44)
   added: (pointing satellite0 star46)
   goals met: 23 of 26
55. (take_image satellite0 star46 instrument0 thermograph0)
   added: (have_image star46 thermograph0)
   goals met: 24 of 26
56. (turn_to satellite0 star50 star46)
   deleted: (pointing satellite0 star46)
   added: (pointing satellite0 star50)
   goals met: 24 of 26
57. (take_image satellite0 star50 instrument0 infrared2)
   added: (have_image star50 infrared2)
   goals met: 25 of 26
58. (turn_to satellite0 star64 star50)
   deleted: (pointing satellite0 star50)
   added: (pointing satellite0 star64)
   goals met: 25 of 26
59. (take_image satellite0 star64 instrument0 thermograph0)
   added: (have_image star64 thermograph0)
   goals met: 26 of 26
